src/Books Review/The Elements of Style.org
#+SETUPFILE: ~/.emacs.d/src/org-templates/level-1.org
#+TITLE: The Elements of Style
#+OPTIONS:  H:2


* 使用规则
** 加's来形成单数名词地所有格
无论最有一个辅音是什么，都遵循这条规则。所以写成，

+ Charles's friend
+ Burns's poems
+ the witch's malice

例外是古代以-es和-is为结尾地专有名词地所有格，所有格Jesus'，和这样地形
式for conscience's sake, for righteousness' sake。但是如此的形式
Moses's Laws, Isis' temple 通常被如下所代替

+ the laws of Moses
+ the temple of Isis

代词hers, its, theirs, yours和ours没有撇号。但是，不定代词使用撇号来表
明所有格。

+ one's rights
+ somebody else's umbrella

一个通常的错误是，把it's写成its, 或反之。第一个是“it is”的缩写，第二个
是个所有格。

~It's a wise dog that scratches its own fleas.~

** 在由一个连接词连接的超过3个东西的序列中，在除了最后一个外的每个东西后使用逗号
所以写成
#+begin_verse
red, white, and blue golder, silver, or copper
He opened the letter, read it, and made a note of its content.
#+end_verse

