public_html/Books Review/The Elements of Style.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>The Elements of Style</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="The Elements of Style"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-08-27 10:23:57 HKT"/>
<meta name="author" content="Shi Shougang"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" href="./assets/stylesheet.css" type="text/css"/>
<link rel="stylesheet" type="text/css" href="../assets/stylesheet.css" />

</head>
<body>
<div id="org-div-home-and-up" style="text-align:right;font-size:70%;white-space:nowrap;">
 <a accesskey="h" href="../index.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">The Elements of Style</h1>



<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 使用规则</a>
<ul>
<li><a href="#sec-1-1">1.1 加's来形成单数名词地所有格</a></li>
<li><a href="#sec-1-2">1.2 在由一个连接词连接的超过3个东西的序列中，在除了最后一个外的每个东西后使用逗号</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 使用规则</h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> 加's来形成单数名词地所有格</h3>
<div class="outline-text-3" id="text-1-1">

<p>无论最有一个辅音是什么，都遵循这条规则。所以写成，
</p>
<ul>
<li>Charles's friend
</li>
<li>Burns's poems
</li>
<li>the witch's malice
</li>
</ul>


<p>
例外是古代以-es和-is为结尾地专有名词地所有格，所有格Jesus'，和这样地形
式for conscience's sake, for righteousness' sake。但是如此的形式
Moses's Laws, Isis' temple 通常被如下所代替
</p>
<ul>
<li>the laws of Moses
</li>
<li>the temple of Isis
</li>
</ul>


<p>
代词hers, its, theirs, yours和ours没有撇号。但是，不定代词使用撇号来表
明所有格。
</p>
<ul>
<li>one's rights
</li>
<li>somebody else's umbrella
</li>
</ul>


<p>
一个通常的错误是，把it's写成its, 或反之。第一个是“it is”的缩写，第二个
是个所有格。
</p>
<p>
<code>It's a wise dog that scratches its own fleas.</code>
</p>
</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> 在由一个连接词连接的超过3个东西的序列中，在除了最后一个外的每个东西后使用逗号</h3>
<div class="outline-text-3" id="text-1-2">

<p>所以写成
</p>
<p class="verse">
red, white, and blue golder, silver, or copper<br/>
He opened the letter, read it, and made a note of its content.<br/>
</p>


</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2012-08-27 10:23:57 HKT</p>
<p class="author">Author: Shi Shougang</p>
<p class="creator">Org version 7.8.09 with Emacs version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
